BobFredGard/CTRL-ESP32-AMPERO-TONEX/src/main.cpp
void handleControlChange(byte channel, byte number, byte value) {
  if (channel == 16) {
    preID = id; 
    id_init = value; id = value;
    pied = 0;
    count1 = 0; count2 = 0; menus = 0;
    selectBank(); chgtPedal();
    BoutRot(1, menus);
    Screens(2, 0);
  }

  if (channel == 15) {
    preID = id; 
    id = id_init + value;
    pied = value; 
    count1 = 0; count2 = 0; menus = 0;
    selectBank(); chgtPedal();
    BoutRot(1, menus);
    Screens(2, 0);
  }
}

void setup() {
  pinMode(33, OUTPUT); pinMode(32, OUTPUT); pinMode(25, OUTPUT);

  pied = 0; preID = -1; 
  
  LCD.init();
  LCD.backlight();
  
  Screens(0, 0);
  
  Serial.begin(115200);

  Wire.begin(22, 21);

  /*cp.begin_I2C();
  for (i = 1; i < 7; i++){mcp.pinMode(i, OUTPUT); mcp.digitalWrite(i, LOW);}
  for (i = 21; i < 27; i++){mcp.pinMode(i, OUTPUT); mcp.digitalWrite(i, LOW);}*/

  /*button1.setPressTicks(500);
  button2.setPressTicks(500);
  button3.setPressTicks(500);
  button4.setPressTicks(500);
  button5.setPressTicks(500);
  button6.setPressTicks(500);*/
  button7.setPressTicks(500);
  button8.setPressTicks(500);

  /*button1.attachClick([] () {if(menus == 0) {preID = pied; pied = 0; id = id_init;   chgtPedal();}});
  button2.attachClick([] () {if(menus == 0) {preID = pied; pied = 1; id = id_init+1; chgtPedal();}});
  button3.attachClick([] () {if(menus == 0) {preID = pied; pied = 2; id = id_init+2; chgtPedal();}});
  button4.attachClick([] () {if(menus == 0) {preID = pied; pied = 3; id = id_init+3; chgtPedal();}});
  button5.attachClick([] () {if(menus == 0) {preID = pied; pied = 4; id = id_init+4; chgtPedal();}});
  button6.attachClick([] () {if(menus == 0) {preID = pied; pied = 5; id = id_init+5; chgtPedal();}});*/
  button7.attachClick([] () {if(menus == 0) {BoutRot(1, menus);} if(menus == 1) {BoutRot(1, menus);}});
  button8.attachClick([] () {if(menus == 0) {BoutRot(2, menus);} if(menus == 1) {BoutRot(2, menus);}});

 /*button1.attachLongPressStop([] () {});
  button2.attachLongPressStop([] () {});
  button3.attachLongPressStop([] () {});
  button4.attachLongPressStop([] () {});
  button5.attachLongPressStop([] () {});
  button6.attachLongPressStop([] () {});*/
  button7.attachLongPressStop([] () {texteline2 = "toto"; menus = 1; BoutRot(1, menus);});
  button8.attachLongPressStop([] () {texteline2 = "toto"; menus = 1; BoutRot(2, menus);});

  MIDI.begin(MIDI_CHANNEL_OMNI);  
  MIDI.setHandleControlChange(handleControlChange);

  if(SPIFFS.begin(true)){
    File root = SPIFFS.open("/"); id = 1, preID = 1; selectBank(); chgtPedal();}
  else {Serial.println("SPIFFS marche pas");} 

  ESP32Encoder::useInternalWeakPullResistors=NONE;
  encoder1.attachSingleEdge(15, 4);
  encoder2.attachSingleEdge(18, 19);
  encoder1.clearCount();
  encoder1.setFilter(1023);
  encoder2.clearCount();
  encoder2.setFilter(1023);
    
  //previousMillis = millis();

  initEncoder(1);

  texteline2, texteline1 = "toto";
  BoutRot(1, menus);
  BoutRot(2, menus);
  //id = 40;
  Screens(2, 0);
}
//----------------------------------------------------------------------------------END SETUP

void loop(){
  /*button1.tick();
  button2.tick();
  button3.tick();
  button4.tick();
  button5.tick();
  button6.tick();*/
  button7.tick();
  button8.tick();
  if (enc1last != encoder1.getCount()) {
    if (count1 == 0) {count1 = 1;}
    encod1(encvalmin1[count1],encvalmax1[count1],params[id][Amperoquick[1][count1]],0);
    texteline2, texteline1 = "toto";
  }  
  if (enc2last != encoder2.getCount()) {
    if (count2 == 0) {count2 = 1;}
    encod2(encvalmin2[count2],encvalmax2[count2],params[id] [toneXquick[1][count2]],0);
    texteline2, texteline1 = "toto";
  }
  MIDI.read();
  if (startcharg == 2) {startcharg = 0; menus = 0; texteline1 = "toto"; texteline2 = "toto"; BoutRot(1, menus); Screens(2, 0);}  
  if (startcharg == 3) {startcharg = 0; menus = 0; texteline1 = "toto"; texteline2 = "toto"; BoutRot(2, menus); Screens(3, 0);}
}

